<?php

/******************************************************************************
 * С помощью cookie создайте механизм запоминания количества посещений
 * страницы пользователем. При каждой загрузке страницы выведите текущее
 * количество посещений.
 *****************************************************************************/

$views_counter = 1;

if (isset($_COOKIE['views']) && is_numeric($_COOKIE['views'])) {
    $views_counter = $_COOKIE['views'] + 1;
}

setcookie('views', $views_counter);

echo($views_counter);
