<?php

/******************************************************************************
 * Создайте функцию, принимающую три аргумента — имя, фамилию и возраст.
 * Функция должна выводить HTML-таблицу, ячейками которой и будут эти
 * аргументы. Несколько раз вызовите функцию.
 *****************************************************************************/

function createRow($name, $sur_name, $age) {
    echo("<tr><td>$name</td><td>$sur_name</td><td>$age</td></tr>");
}

echo('<table><tbody>');
createRow('Ivan', 'Ivanow', 25);
createRow('Petr', 'Sidorow', 21);
createRow('Vladimir', 'Zeleniy', 28);
echo('</tbody></table>');

